In [4]:
import pandas as pd

**Pandas Nedir ?**
* **
**Veri bilimi ve yapay zeka uygulamalarında kullanılan güzel bir kütüphanedir. Panel Data açılımı. Numpy dan farklı olarak yapısal veri setleri ile daha esnek ve kolay şekilde çalışabiliriz. Ekonometrik ve finansal çalışmalar için doğmuştur. R Dataframe yapısını Python dünyasına taşımış ve Dataframeler üzerinde hızlı ve etkin çalışabilme imkanı sağlamıştır.**

**Pandas Serisi Oluşturmak**
* **
* _**pd.Series([1,2,3,4])**_


ilk sütun serideki elemanların indeks numarası ikinci sütundaki değerler ise elemanların kendisidir. Pandas serileri değerleri indeksleri ile beraber tutar bu numpy arraylerinden bir farkıdır.

* _**seri.dtype**_ => seri içindeki verinin tipini verir.
* _**seri.axes**_ => seri indeks bilgilerini verir.
* _**seri.size**_ => seri içindeki eleman sayısını verir.
* _**seri.ndim**_ => serinin boyut sayısını verir.
* _**seri.values**_ => serinin tıpkı bir numpy array gibi erişim sağlatır.
* _**seri.head(args)**_ => seriye sayı bazlı erişim sağlar örnek 3 yazarsak ilk 3 elemanı indeksleriyle beraber getirir.
* _**seri.tail(args)**_ => seriye sayı bazlı erişim sağlar örnek 3 yazarsak son 3 elemanı indeksleriyle beraber getirir.

In [5]:
pd.Series([1,2,3,4])

0    1
1    2
2    3
3    4
dtype: int64

In [6]:
seri = pd.Series([1,2,3,4])
type(seri)

pandas.core.series.Series

In [7]:
seri.axes

[RangeIndex(start=0, stop=4, step=1)]

In [8]:
seri.dtype

dtype('int64')

In [9]:
seri.size

4

In [10]:
seri.ndim

1

In [11]:
seri.values

array([1, 2, 3, 4], dtype=int64)

In [12]:
seri.head(3)

0    1
1    2
2    3
dtype: int64

In [13]:
seri.tail(3)

1    2
2    3
3    4
dtype: int64

**İndeks isimlendirmesi**
* **
* pd.Series([99,22,232,94,5])

Eğer indeks numaralarını farklı yazmak istersek 

* pd.Series([99,22,232,94,5], index = [1,3,5,7,9])

Artık 0 1 2 3 4 yerine 1 3 5 7 9 yazacak

Aynı zamanda bu isimlendirmeleri String değerler ile de yapabiliriz.

In [14]:
pd.Series([99,22,232,94,5])

0     99
1     22
2    232
3     94
4      5
dtype: int64

In [15]:
pd.Series([99,22,232,94,5],index=[1,3,5,7,9])

1     99
3     22
5    232
7     94
9      5
dtype: int64

In [16]:
seri = pd.Series([99,22,232,94,5],index=["ahmet","mehmet","ayşe","fatma","reyyan"])

In [17]:
seri

ahmet      99
mehmet     22
ayşe      232
fatma      94
reyyan      5
dtype: int64

In [18]:
seri["reyyan"]
#sözlük mantığında key-values ilişkisi vardır.
seri["ahmet":"ayşe"]
#slice işlemi

ahmet      99
mehmet     22
ayşe      232
dtype: int64

In [19]:
#Sözlük üzerinden pandas serisi oluşturmak
sozluk = pd.Series({"reg":10,"log":11,"cart":12})
sozluk

reg     10
log     11
cart    12
dtype: int64

In [20]:
#İki seriyi birleştirerek yeni bir seri oluşturma
pd.concat([seri,sozluk])

ahmet      99
mehmet     22
ayşe      232
fatma      94
reyyan      5
reg        10
log        11
cart       12
dtype: int64

**Serilerde eleman işlemleri**
* **
* Eleman erişimi => a[0] indeksle erişim, slice a[0:3]
* Sadece index erişimi => seri.index
* Keys erişim => seri.keys
* list(seri.items()) => key-value şeklinde verir.
* seri.item => ilk elementi döner.
* seri.values => sadece değerlere erişim sağlar.
* seri.value_counts(True) => seri içindeki değerlerden yüzdelik kaç olduğunu gösterir.

In [21]:
import numpy as np
a = np.random.randint(10,99,size=5)
a

array([35, 91, 19, 17, 63])

In [22]:
seri = pd.Series(a)
seri

0    35
1    91
2    19
3    17
4    63
dtype: int32

In [23]:
seri[0]

35

In [24]:
seri[0:3]

0    35
1    91
2    19
dtype: int32

In [25]:
seri = pd.Series([121,200,150,99,121], index=["a","b","c","d","e"])
seri

a    121
b    200
c    150
d     99
e    121
dtype: int64

In [26]:
seri.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [27]:
seri.keys

<bound method Series.keys of a    121
b    200
c    150
d     99
e    121
dtype: int64>

In [28]:
list(seri.items())

[('a', 121), ('b', 200), ('c', 150), ('d', 99), ('e', 121)]

In [29]:
seri.item

<bound method IndexOpsMixin.item of a    121
b    200
c    150
d     99
e    121
dtype: int64>

In [30]:
seri.values

array([121, 200, 150,  99, 121], dtype=int64)

In [31]:
seri.value_counts(True)

121    0.4
200    0.2
150    0.2
99     0.2
dtype: float64

In [32]:
#Eleman sorgulama
"a" in seri

True

In [33]:
#Fancy index kullanımı
seri[["a","e"]]

a    121
e    121
dtype: int64

In [34]:
#Değer değiştirme
seri["e"] = 130

In [35]:
seri[["a","e"]]

a    121
e    130
dtype: int64

**Pandas Dataframe**
* **

*  import numpy as np
*  m = np.arrange(1,10).reshape((3,3))
* _**pd.DataFrame(m, columns = ["arg1","arg2","arg3"])**_
*  _**df.columns**_ değişken isimlerini getirir.

In [36]:
import numpy as np
m = np.arange(1,10).reshape((3,3))
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [37]:
pd.DataFrame(m,columns=["var1","var2","var3"])

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [38]:
#df isimlendirme
df = pd.DataFrame(m,columns=["var1","var2","var3"])
df.head()

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [39]:
df.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [40]:
# değişken isim değiştirme işlemi
df.columns = ("deg1","deg2","deg3")

In [41]:
df

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [42]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['deg1', 'deg2', 'deg3'], dtype='object')]

In [43]:
df.shape

(3, 3)

In [44]:
df.ndim

2

In [45]:
df.size

9

In [46]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [47]:
df.tail(2)

   deg1  deg2  deg3
1     4     5     6
2     7     8     9

In [48]:
#Eleman işlemleri
s1 = np.random.randint(10, size=5)
s2 = np.random.randint(10, size=5)
s3 = np.random.randint(10, size=5)

sozluk = {"var1":s1, "var2":s2, "var3":s3}
df = pd.DataFrame(sozluk)

df

   var1  var2  var3
0     2     3     5
1     7     1     2
2     8     8     3
3     8     4     7
4     1     5     4

In [49]:
df[0:3]

   var1  var2  var3
0     2     3     5
1     7     1     2
2     8     8     3

In [50]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [51]:
df.index = ["a","b","c","d","e"]

In [52]:
df

   var1  var2  var3
a     2     3     5
b     7     1     2
c     8     8     3
d     8     4     7
e     1     5     4

In [53]:
df["c":"e"]

   var1  var2  var3
c     8     8     3
d     8     4     7
e     1     5     4

In [54]:
#silme
df.drop("a",axis=0)

   var1  var2  var3
b     7     1     2
c     8     8     3
d     8     4     7
e     1     5     4

In [55]:
df
#veri seti üstünde değişim olmadı

   var1  var2  var3
a     2     3     5
b     7     1     2
c     8     8     3
d     8     4     7
e     1     5     4

In [56]:
#eğer değişimin kalıcı olmasını istersek bu ifadeyi ekleyerek sağlayabiliriz.
df.drop("a",axis=0,inplace=True)

In [57]:
df

   var1  var2  var3
b     7     1     2
c     8     8     3
d     8     4     7
e     1     5     4

In [58]:
df

   var1  var2  var3
b     7     1     2
c     8     8     3
d     8     4     7
e     1     5     4

In [59]:
#fancy
l = ["c","e"]
df.drop(l,axis= 0)

   var1  var2  var3
b     7     1     2
d     8     4     7

In [60]:
#değişkenler için
"var1" in df

True

In [61]:
l = ["var1","var4","var2"]

for i in l :
    print(i in df, end="-")

True-False-True-

In [62]:
#yeni bir değişken ekleme
df["var4"] = df["var1"]/df["var2"]

In [63]:
df

   var1  var2  var3  var4
b     7     1     2   7.0
c     8     8     3   1.0
d     8     4     7   2.0
e     1     5     4   0.2

In [64]:
#değişken silme
df.drop("var4",axis=1)

   var1  var2  var3
b     7     1     2
c     8     8     3
d     8     4     7
e     1     5     4

**Gözlem ve Değişken Seçimi**
* **

In [65]:
import numpy as np
import pandas as pd

m = np.random.randint(1,30, size=(10,3))
df = pd.DataFrame(m, columns=["var1","var2","var3"])
df

   var1  var2  var3
0    16     4    23
1    14    28     5
2     6    28    20
3    14    27     8
4    29    13     2
5    19    23     8
6    21     3    10
7    12    16    15
8    26    11    23
9     7    11     4

In [66]:
#loc : tanımlandığı şekli ile seçim yapmak için kullanılır.
df.loc[0:3]
# burada 0 dan 3 dahil gözlem seçimi yaptı.

   var1  var2  var3
0    16     4    23
1    14    28     5
2     6    28    20
3    14    27     8

In [67]:
#iloc : alışık olduğumuz indexleme mantığı ile seçim yapar.
df.iloc[0:3]
# burada 0 dan 3 e kadar gözlem seçimi yaptı.
# isimlendirmeden bağımsız işlem görür.

   var1  var2  var3
0    16     4    23
1    14    28     5
2     6    28    20

In [68]:
df.iloc[0,0]

16

In [69]:
df.iloc[:3,:2]

   var1  var2
0    16     4
1    14    28
2     6    28

In [70]:
df.loc[0:2,"var3"] #değişken-gözlem ikilisi için yaygın bu kullanılır.T

0    23
1     5
2    20
Name: var3, dtype: int32

In [71]:
df.iloc[0:3,1:3]

   var2  var3
0     4    23
1    28     5
2    28    20

In [72]:
df.iloc[0:3]["var3"] #iloc ile değişken-gözlem ikilisi için bu kullanılır.

0    23
1     5
2    20
Name: var3, dtype: int32

**Koşullu Eleman İşlemleri**
* **

In [73]:
import numpy as np
import pandas as pd

m = np.random.randint(1,30, size=(10,3))
df = pd.DataFrame(m, columns=["var1","var2","var3"])
df

   var1  var2  var3
0    13     8    27
1     8     9     5
2     6     9    24
3    18    24     8
4    13    21    22
5    27    17    21
6     1    22    17
7    21    28    24
8     6     3    12
9    11    13    11

In [74]:
df["var1"] > 15

0    False
1    False
2    False
3     True
4    False
5     True
6    False
7     True
8    False
9    False
Name: var1, dtype: bool

In [75]:
df[df.var1 > 15] #tek değişkenli filtreleme

   var1  var2  var3
3    18    24     8
5    27    17    21
7    21    28    24

In [76]:
df[(df.var1 > 15) & (df.var3 < 5)] #çoklu şart filtrelemesi

Empty DataFrame
Columns: [var1, var2, var3]
Index: []

In [77]:
df[(df.var1 > 15)][["var1","var2"]]

   var1  var2
3    18    24
5    27    17
7    21    28

In [78]:
df.loc[(df.var1 > 15) , ["var1","var2"]]

   var1  var2
3    18    24
5    27    17
7    21    28

**Birleştirme (Join) İşlemleri**
* **

In [79]:
import numpy as np
import pandas as pd

m = np.random.randint(1,30, size=(5,3))
df1 = pd.DataFrame(m, columns=["var1","var2","var3"])
df1

   var1  var2  var3
0    23     4     8
1     4    24    23
2    10    24     4
3    20    22    13
4     7    19    27

In [80]:
df2 = df1 + 99
df2

   var1  var2  var3
0   122   103   107
1   103   123   122
2   109   123   103
3   119   121   112
4   106   118   126

In [81]:
pd.concat([df1,df2])

   var1  var2  var3
0    23     4     8
1     4    24    23
2    10    24     4
3    20    22    13
4     7    19    27
0   122   103   107
1   103   123   122
2   109   123   103
3   119   121   112
4   106   118   126

In [82]:
pd.concat([df1,df2],ignore_index=True) #bu ifadeyi ekleyince indeks problemi ortadan kalkar.

   var1  var2  var3
0    23     4     8
1     4    24    23
2    10    24     4
3    20    22    13
4     7    19    27
5   122   103   107
6   103   123   122
7   109   123   103
8   119   121   112
9   106   118   126

In [83]:
df1.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [84]:
df2.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [85]:
df2.columns = ["var1","var2","deg3"]

In [86]:
df2

   var1  var2  deg3
0   122   103   107
1   103   123   122
2   109   123   103
3   119   121   112
4   106   118   126

In [87]:
df1

   var1  var2  var3
0    23     4     8
1     4    24    23
2    10    24     4
3    20    22    13
4     7    19    27

In [88]:
pd.concat([df1,df2],ignore_index=True, join="inner")
#Kesisimlere göre birleştirildi.

   var1  var2
0    23     4
1     4    24
2    10    24
3    20    22
4     7    19
5   122   103
6   103   123
7   109   123
8   119   121
9   106   118

**İleri Birleştirme İşlemleri**
* **

In [95]:
import pandas as pd

In [90]:
#birebir birleştirme

df1 = pd.DataFrame({"calisanlar" : ["Ayse","Ali","Veli","Fatma"],
                    "grup":["Muhasabe","Muhendislik","Muhendislik","İK"]})
df1

  calisanlar         grup
0       Ayse     Muhasabe
1        Ali  Muhendislik
2       Veli  Muhendislik
3      Fatma           İK

In [91]:
df2 = pd.DataFrame({"calisanlar" : ["Ayse","Ali","Veli","Fatma"],
                    "ilk_giris":[2010,2009,2014,2019]})
df2

  calisanlar  ilk_giris
0       Ayse       2010
1        Ali       2009
2       Veli       2014
3      Fatma       2019

In [118]:
pd.merge(df1,df2) #birleştirmelerin hangi değişkene göre yapılacağını belirtir. pk-fk ilişkisi

  calisanlar         grup  ilk_giris
0       Ayse     Muhasabe       2010
1        Ali  Muhendislik       2009
2       Veli  Muhendislik       2014
3      Fatma           İK       2019

In [ ]:
#many to one
df3 = pd.merge(df1,df2)
df3

  calisanlar         grup  ilk_giris
0       Ayse     Muhasabe       2010
1        Ali  Muhendislik       2009
2       Veli  Muhendislik       2014
3      Fatma           İK       2019

In [ ]:
df4 = pd.DataFrame({"grup":["Muhasabe","Muhendislik","İK"],
                    "mudur":["Caner","Mustafa","Berkcan"]})
df4

          grup    mudur
0     Muhasabe    Caner
1  Muhendislik  Mustafa
2           İK  Berkcan

In [ ]:
pd.merge(df3,df4)

  calisanlar         grup  ilk_giris    mudur
0       Ayse     Muhasabe       2010    Caner
1        Ali  Muhendislik       2009  Mustafa
2       Veli  Muhendislik       2014  Mustafa
3      Fatma           İK       2019  Berkcan

In [98]:
#many to many
df5 = pd.DataFrame({"grup":["Muhasebe","Muhasebe",
                            "Muhendislik","Muhendislik","İK","İK"],
                            "yetenekler":["matematik","excel","kodlama","linux","excel","yonetim"]})

In [99]:
df5

          grup yetenekler
0     Muhasebe  matematik
1     Muhasebe      excel
2  Muhendislik    kodlama
3  Muhendislik      linux
4           İK      excel
5           İK    yonetim

In [100]:
pd.merge(df1,df5)

  calisanlar         grup yetenekler
0        Ali  Muhendislik    kodlama
1        Ali  Muhendislik      linux
2       Veli  Muhendislik    kodlama
3       Veli  Muhendislik      linux
4      Fatma           İK      excel
5      Fatma           İK    yonetim

In [106]:
import seaborn as sns #bazı veri setleri var bu kütüphane içinde github.com/seaborn-data ordaki veri setlerine bakabilirsiniz.
df = sns.load_dataset("planets")

df.head(10)

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009
5  Radial Velocity       1         185.840   4.80     76.39  2008
6  Radial Velocity       1        1773.400   4.64     18.15  2002
7  Radial Velocity       1         798.500    NaN     21.41  1996
8  Radial Velocity       1         993.300  10.30     73.10  2008
9  Radial Velocity       2         452.800   1.99     74.79  2010

**Toplulaştırma İşlemleri**

* **

In [107]:
df.shape

(1035, 6)

In [108]:
df.count()

method            1035
number            1035
orbital_period     992
mass               513
distance           808
year              1035
dtype: int64

In [109]:
df.min()

method            Astrometry
number                     1
orbital_period      0.090706
mass                  0.0036
distance                1.35
year                    1989
dtype: object

In [111]:
df.mean()
df["mass"].mean()

C:\Users\pegas\AppData\Local\Temp\ipykernel_9344\1719860017.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.mean()

2.6381605847953216

In [112]:
df.std()

C:\Users\pegas\AppData\Local\Temp\ipykernel_9344\3390915376.py:1: FutureWarning: The default value of numeric_only in DataFrame.std is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.std()

number                1.240976
orbital_period    26014.728304
mass                  3.818617
distance            733.116493
year                  3.972567
dtype: float64

In [113]:
df.sum()

method            Radial VelocityRadial VelocityRadial VelocityR...
number                                                         1848
orbital_period                                       1986894.255326
mass                                                     1353.37638
distance                                                  213367.98
year                                                        2079388
dtype: object

In [119]:
df.var()

C:\Users\pegas\AppData\Local\Temp\ipykernel_9344\1568254755.py:1: FutureWarning: The default value of numeric_only in DataFrame.var is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.var()

number            1.540022e+00
orbital_period    6.767661e+08
mass              1.458183e+01
distance          5.374598e+05
year              1.578129e+01
dtype: float64

In [117]:
df.describe() #betimsel istatistik sağlar.
df.describe().T #transpozunu alarak gösteriyor

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [120]:
df.dropna().describe().T #içindeki eksik değerleri silip düzgün gösterim sağlar.

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

**Gruplaştırma işlemleri**

* **

* Veri setinde yer alan kategorik değişkenlerin gruplarının yakalanması ve bu gruplar üstünde bazı işlemler yapılmasına denir.

In [121]:
df = pd.DataFrame({"gruplar":["A","B","C","A","B","C"], "veri":[10,11,52,23,43,55]},columns=["gruplar","veri"])

df

  gruplar  veri
0       A    10
1       B    11
2       C    52
3       A    23
4       B    43
5       C    55

In [126]:
group = df.groupby("gruplar") # df içindeki grupları tutan bir obj oluşturur. Tek başına kullanılmaz topluluaştırma fonksiyonu ister.

In [127]:
group.count()

         veri
gruplar
A           2
B           2
C           2

In [128]:
group.mean()

         veri
gruplar
A        16.5
B        27.0
C        53.5

In [129]:
group.sum()

         veri
gruplar
A          33
B          54
C         107

In [130]:
df = sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [131]:
df.groupby("method") #neye göre gruplayacağını belirler.

In [135]:
groups = df.groupby("method")["orbital_period"] #karmaşık veri setlerinde kullanmak için değişken ister.

In [136]:
groups.mean()

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

In [137]:
groups.describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,631.180000,544.217663,246.360000,438.770000,631.180000,823.590000,1016.000000
Eclipse Timing Variations,9.0,4751.644444,2499.130945,1916.250000,2900.000000,4343.500000,5767.000000,10220.000000
Imaging,12.0,118247.737500,213978.177277,4639.150000,8343.900000,27500.000000,94250.000000,730000.000000
Microlensing,7.0,3153.571429,1113.166333,1825.000000,2375.000000,3300.000000,3550.000000,5100.000000
Orbital Brightness Modulation,3.0,0.709307,0.725493,0.240104,0.291496,0.342887,0.943908,1.544929
Pulsar Timing,5.0,7343.021201,16313.265573,0.090706,25.262000,66.541900,98.211400,36525.000000
Pulsation Timing Variations,1.0,1170.000000,NaN,1170.000000,1170.000000,1170.000000,1170.000000,1170.000000
Radial Velocity,553.0,823.354680,1454.926210,0.736540,38.021000,360.200000,982.000000,17337.500000
Transit,397.0,21.102073,46.185893,0.355000,3.160630,5.714932,16.145700,331.600590
Transit Timing Variations,3.0,79.783500,71.599884,22.339500,39.675250,57.011000,108.505500,160.000000

**İleri Topluluaştırma Dönüştürme İşlemleri**

* **

In [138]:
import pandas as pd 

df = pd.DataFrame({'gruplar':['A','B','C','A','B','C'], 'degisken1': [10,23,33,22,11,99],
                   'degisken2':[100,253,333,262,111,969]},columns=["gruplar","degisken1","degisken2"])

df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [142]:
#aggregate fonksiyonu bu toplulaştırma işlemlerinde farklı ifadeler kullanarak işlem yapmamızı sağlayan bir fonksiyondur.
#burada 3 farklı ifadeye göre birini yazılı olarak diğerini numpydan diğerinide direk ifade oalrak çağırıp işlem yaptık.
df.groupby('gruplar').aggregate(["min",np.median,max])

        degisken1            degisken2
              min median max       min median  max
gruplar
A              10   16.0  22       100  181.0  262
B              11   17.0  23       111  182.0  253
C              33   66.0  99       333  651.0  969

In [143]:
df.groupby('gruplar').aggregate({"degisken1":min,"degisken2":max})

         degisken1  degisken2
gruplar
A               10        262
B               11        253
C               33        969

In [147]:
#filter ileri filtreleme işlemleri için kullanılır. Pythondakinden farkı filter içinde bir liste istemez parametre olarak.
df.groupby('gruplar').filter(lambda x : x["degisken1"].std() > 9)

  gruplar  degisken1  degisken2
2       C         33        333
5       C         99        969

In [151]:
#transform değişkenler üzerinde ileri değişiklik yapmamızı sağlar.
df.groupby('gruplar').transform(lambda x : (x - x.mean()) / x.std())

   degisken1  degisken2
0  -0.707107  -0.707107
1   0.707107   0.707107
2  -0.707107  -0.707107
3   0.707107   0.707107
4  -0.707107  -0.707107
5   0.707107   0.707107

In [155]:
#apply fonksiyonu transform ve filter gibi dataframe üstünde gezebilen toplulaştırma işlemlerinde kullanılan bir fonksiyondur.

df.apply(np.sum)

gruplar      ABCABC
degisken1       198
degisken2      2028
dtype: object

In [157]:
df.groupby('gruplar').apply(np.mean) #bu şekildede kullanımı oluyor.

c:\ProgramData\anaconda3\lib\site-packages\numpy\core\fromnumeric.py:3430: FutureWarning: In a future version, DataFrame.mean(axis=None) will return a scalar mean over the entire DataFrame. To retain the old behavior, use 'frame.mean(axis=0)' or just 'frame.mean()'
  return mean(axis=axis, dtype=dtype, out=out, **kwargs)
c:\ProgramData\anaconda3\lib\site-packages\numpy\core\fromnumeric.py:3430: FutureWarning: The operation <function mean at 0x0000022CDC8F0700> failed on a column. If any error is raised, this will raise an exception in a future version of pandas. Drop these columns to avoid this warning.
  return mean(axis=axis, dtype=dtype, out=out, **kwargs)
c:\ProgramData\anaconda3\lib\site-packages\numpy\core\fromnumeric.py:3430: FutureWarning: In a future version, DataFrame.mean(axis=None) will return a scalar mean over the entire DataFrame. To retain the old behavior, use 'frame.mean(axis=0)' or just 'frame.mean()'
  return mean(axis=axis, dtype=dtype, out=out, **kwargs)
c:\ProgramData\anaconda3\lib\site-packages\numpy\core\fromnumeric.py:3430: FutureWarning: The operation <function mean at 0x0000022CDC8F0700> failed on a column. If any error is raised, this will raise an exception in a future version of pandas. Drop these columns to avoid this warning.
  return mean(axis=axis, dtype=dtype, out=out, **kwargs)
c:\ProgramData\anaconda3\lib\site-packages\numpy\core\fromnumeric.py:3430: FutureWarning: In a future version, DataFrame.mean(axis=None) will return a scalar mean over the entire DataFrame. To retain the old behavior, use 'frame.mean(axis=0)' or just 'frame.mean()'
  return mean(axis=axis, dtype=dtype, out=out, **kwargs)
c:\ProgramData\anaconda3\lib\site-packages\numpy\core\fromnumeric.py:3430: FutureWarning: The operation <function mean at 0x0000022CDC8F0700> failed on a column. If any error is raised, this will raise an exception in a future version of pandas. Drop these columns to avoid this warning.
  return mean(axis=axis, dtype=dtype, out=out, **kwargs)

         degisken1  degisken2
gruplar
A             16.0      181.0
B             17.0      182.0
C             66.0      651.0

**Pivot Tablolar**
* ** 

* GroupBy ın çok boyutlu bir versiyonu olarak düşünülebilir.

In [158]:
import pandas as pd
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [161]:
titanic.groupby('sex')[["survived"]].mean()  #grupby içindeki sıralama değişkeni köşeli parantezdeki sürekli değişken

        survived
sex
female  0.742038
male    0.188908

In [162]:
titanic.groupby(['sex',"class"])[["survived"]].aggregate("mean").unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [163]:
#pivot ile table
titanic.pivot_table("survived",index="sex",columns="class")

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [164]:
,titanic.age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [166]:
age = pd.cut(titanic["age"], [0,18,90])
age.head(10)

0    (18.0, 90.0]
1    (18.0, 90.0]
2    (18.0, 90.0]
3    (18.0, 90.0]
4    (18.0, 90.0]
5             NaN
6    (18.0, 90.0]
7     (0.0, 18.0]
8    (18.0, 90.0]
9     (0.0, 18.0]
Name: age, dtype: category
Categories (2, interval[int64, right]): [(0, 18] < (18, 90]]

In [167]:
titanic.pivot_table("survived", ["sex",age],"class")

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 90]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 90]  0.375000  0.071429  0.133663

**Dış Kaynaklı Veri Okumak**

* **

In [168]:
import pandas as pd 
#pd.read_csv() csv txt dosyası okur
#pd.read_excel()  excel dosyası okur